[
  {
    "id": "doc_bf_1",
    "title": "30-Day Breastfeeding Complete Guide",
    "category": "breastfeeding",
    "fileName": "merged-breastfeeding-30-days.pdf",
    "path": "AI Intellect Pool/Breastfeeding Resources/merged-breastfeeding-30-days.pdf",
    "content": "\n    DAY 1-3: ESTABLISHING LATCH AND COLOSTRUM\n    \n    Welcome to your breastfeeding journey! The first few days are crucial for establishing a good foundation.\n    \n    Golden Hour: Within the first hour after birth, place your baby skin-to-skin and allow them to naturally find your breast. This initial contact helps establish the breastfeeding relationship.\n    \n    Colostrum: Your first milk is thick, golden, and incredibly nutrient-dense. Even small amounts (teaspoons) are perfect for your newborn's tiny stomach.\n    \n    Latch Basics: Position your baby so their nose is level with your nipple. Wait for a wide mouth, then bring baby to breast (not breast to baby). Look for rhythmic sucking and swallowing.\n    \n    Signs of Good Latch: You should hear soft swallowing sounds, see rhythmic jaw movement, and feel comfortable (not painful) nursing.\n    \n    DAY 4-7: MILK TRANSITION AND FREQUENT FEEDING\n    \n    Your milk is transitioning from colostrum to mature milk. This is a critical period for establishing supply.\n    \n    Milk Coming In: You may feel engorged, warm, or full. This is normal! Feed frequently to help with the transition.\n    \n    Feeding Frequency: Newborns typically feed 8-12 times per day. Watch for hunger cues: rooting, sucking motions, bringing hands to mouth.\n    \n    Growth Spurts: Baby may seem constantly hungry. This is normal and helps establish your supply. Feed on demand.\n    \n    WEEK 2-4: SUPPLY REGULATION AND TROUBLESHOOTING\n    \n    Your body is learning to produce the right amount of milk for your baby's needs.\n    \n    Supply and Demand: The more your baby feeds, the more milk you produce. Trust your body and your baby.\n    \n    Common Challenges: Engorgement, sore nipples, cluster feeding, and growth spurts are all normal parts of the process.\n    \n    When to Seek Help: If you're experiencing severe pain, baby isn't gaining weight, or you have concerns about supply.\n    \n    MONTHLY MILESTONES AND LONG-TERM SUCCESS\n    \n    Month 1: Focus on establishing routine and building confidence. Most challenges resolve with time and support.\n    \n    Month 2-3: Supply typically stabilizes. You may notice more predictable feeding patterns.\n    \n    Month 4-6: Introduction of solid foods begins. Continue breastfeeding as primary nutrition.\n    \n    Beyond 6 Months: Breastfeeding continues to provide important nutrition and immune benefits.\n    \n    TROUBLESHOOTING GUIDE\n    \n    Sore Nipples: Ensure proper latch, use lanolin cream, and let nipples air dry between feeds.\n    \n    Engorgement: Apply warm compresses before feeding, cold packs after, and nurse frequently.\n    \n    Low Supply Concerns: Most women produce enough milk. Focus on frequent feeding, proper latch, and adequate nutrition.\n    \n    Pumping Tips: Pump after morning feeds when supply is highest. Store milk properly in the refrigerator or freezer.\n    \n    SUPPORT AND RESOURCES\n    \n    Remember: Every breastfeeding journey is unique. What works for one mother may not work for another.\n    \n    Support Network: Connect with lactation consultants, breastfeeding support groups, and other nursing mothers.\n    \n    Self-Care: Rest when possible, stay hydrated, and eat nutritious foods to support your milk production.\n    \n    Professional Help: Don't hesitate to reach out to healthcare providers or lactation specialists when needed.\n    \n    This comprehensive guide covers the essential elements of successful breastfeeding through the critical first 30 days and beyond.\n  ",
    "chunks": [
      "DAY 1-3: ESTABLISHING LATCH AND COLOSTRUM\n    \n    Welcome to your breastfeeding journey!  The first few days are crucial for establishing a good foundation. \n    \n    Golden Hour: Within the first hour after birth, place your baby skin-to-skin and allow them to naturally find your breast.  This initial contact helps establish the breastfeeding relationship. \n    \n    Colostrum: Your first milk is thick, golden, and incredibly nutrient-dense.  Even small amounts (teaspoons) are perfect for your newborn's tiny stomach. \n    \n    Latch Basics: Position your baby so their nose is level with your nipple.  Wait for a wide mouth, then bring baby to breast (not breast to baby).  Look for rhythmic sucking and swallowing. \n    \n    Signs of Good Latch: You should hear soft swallowing sounds, see rhythmic jaw movement, and feel comfortable (not painful) nursing. \n    \n    DAY 4-7: MILK TRANSITION AND FREQUENT FEEDING\n    \n    Your milk is transitioning from colostrum to mature milk.",
      "This is a critical period for establishing supply. \n    \n    Milk Coming In: You may feel engorged, warm, or full.  This is normal!  Feed frequently to help with the transition. \n    \n    Feeding Frequency: Newborns typically feed 8-12 times per day.  Watch for hunger cues: rooting, sucking motions, bringing hands to mouth. \n    \n    Growth Spurts: Baby may seem constantly hungry.  This is normal and helps establish your supply.  Feed on demand. \n    \n    WEEK 2-4: SUPPLY REGULATION AND TROUBLESHOOTING\n    \n    Your body is learning to produce the right amount of milk for your baby's needs. \n    \n    Supply and Demand: The more your baby feeds, the more milk you produce.  Trust your body and your baby. \n    \n    Common Challenges: Engorgement, sore nipples, cluster feeding, and growth spurts are all normal parts of the process. \n    \n    When to Seek Help: If you're experiencing severe pain, baby isn't gaining weight, or you have concerns about supply.",
      "MONTHLY MILESTONES AND LONG-TERM SUCCESS\n    \n    Month 1: Focus on establishing routine and building confidence.  Most challenges resolve with time and support. \n    \n    Month 2-3: Supply typically stabilizes.  You may notice more predictable feeding patterns. \n    \n    Month 4-6: Introduction of solid foods begins.  Continue breastfeeding as primary nutrition. \n    \n    Beyond 6 Months: Breastfeeding continues to provide important nutrition and immune benefits. \n    \n    TROUBLESHOOTING GUIDE\n    \n    Sore Nipples: Ensure proper latch, use lanolin cream, and let nipples air dry between feeds. \n    \n    Engorgement: Apply warm compresses before feeding, cold packs after, and nurse frequently. \n    \n    Low Supply Concerns: Most women produce enough milk.  Focus on frequent feeding, proper latch, and adequate nutrition. \n    \n    Pumping Tips: Pump after morning feeds when supply is highest.  Store milk properly in the refrigerator or freezer.",
      "SUPPORT AND RESOURCES\n    \n    Remember: Every breastfeeding journey is unique.  What works for one mother may not work for another. \n    \n    Support Network: Connect with lactation consultants, breastfeeding support groups, and other nursing mothers. \n    \n    Self-Care: Rest when possible, stay hydrated, and eat nutritious foods to support your milk production. \n    \n    Professional Help: Don't hesitate to reach out to healthcare providers or lactation specialists when needed. \n    \n    This comprehensive guide covers the essential elements of successful breastfeeding through the critical first 30 days and beyond."
    ],
    "pages": 49,
    "sizeKB": 932,
    "uploadedAt": "2025-10-02T23:33:48.496Z",
    "description": "Dr. Sonal Patel's comprehensive 30-day breastfeeding guide with daily milestones, troubleshooting tips, and expert guidance for new mothers."
  },
  {
    "id": "doc_sleep_1",
    "title": "Safe Sleep for Your Baby",
    "category": "sleep",
    "fileName": "Safe Sleep for Your Baby.pdf",
    "path": "AI Intellect Pool/Sleep Resources/Safe Sleep for Your Baby.pdf",
    "content": "AAP-aligned safe sleep practices, SIDS prevention, and creating a safe sleep environment for newborns and infants.",
    "chunks": [
      "ABC of safe sleep",
      "Room sharing guidelines",
      "Safe sleep products",
      "SIDS risk reduction",
      "Common unsafe practices",
      "Travel and sleep safety"
    ],
    "pages": 212,
    "sizeKB": 10605,
    "uploadedAt": "2025-10-02T20:17:57.758Z",
    "description": "AAP safe sleep recommendations adapted for parent education"
  }
]